test_cases/HiSA/set1_alpha4_sa_ref1/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/freestreamConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T;

boundaryField
{
    "(inlet|outlet)"
    {
       type            characteristicFarfieldTemperature;
        #include        "include/freestreamConditions"
        value           $internalField;
    }

    airfoil
    {
        type            characteristicWallTemperature;
        value           $internalField;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    processor
    {
    	type  processor;
    	value $internalField;
    }
}

// ************************************************************************* //
