test_cases/HiSA/set1_alpha4_sa_ref1/0.orig/include/freestreamConditions
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/

U            (254.59829691 17.80324723 0);
p             1e5;
T             293;
#inputMode    merge

// ************************************************************************* //
