test_cases/HiSA/set1_alpha4_sa_ref1/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/freestreamConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $p;

boundaryField
{

    "(inlet|outlet)"
    {
        type            characteristicFarfieldPressure;
        #include        "include/freestreamConditions"
        value           $internalField;
    }

    airfoil
    {
        type            zeroGradient;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    processor
    {
    	type  processor;
    	value $internalField;
    }	
}

// ************************************************************************* //

