test_cases/HiSA/set1_alpha4_sa_ref1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|    HiSA: High Speed Aerodynamic solver                                      |
|    Copyright (C) 2014-2017 Johan Heyns - CSIR, South Africa                 |
|    Copyright (C) 2014-2017 Oliver Oxtoby - CSIR, South Africa               |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


fluxScheme           AUSMPlusUp;
lowMachAusm          false;

ddtSchemes
{
    default          bounded dualTime rPseudoDeltaT steadyState;
}

gradSchemes
{
    default          faceLeastSquares linear;
    grad(nuTilda)    cellLimited Gauss linear 0.9;
}

divSchemes
{
    default          none;
    div(tauMC)       Gauss linear;
    div(phi,nuTilda) bounded Gauss upwind phi;
}

laplacianSchemes
{
    default                      Gauss linear limited corrected 0.33;
    laplacian(muEff,U)          Gauss linear compact;
    laplacian(alphaEff,e)       Gauss linear compact;
}

interpolationSchemes
{
    default          linear;
    reconstruct(rho) wVanLeer;
    reconstruct(U)   wVanLeer;
    reconstruct(T)   wVanLeer;
}

snGradSchemes
{
    default          corrected;
}

wallDist
{
     method meshWave;
//    method Poisson;
}



// ************************************************************************* //
